Repository: 84000/data-translation-memory
Catalog: toh181-v4.tmx
Source language: bo
Languages: en

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་མི་གང་ལུས་ལ་ཙན་དན་གྱི་འདེ་གུས་སྐུད་པ་དེ་ལ་ཡང་རྗེས་སུ་ཆགས་པ་བསྐྱེད་པར་མི་བྱ། གང་ལུས་ལ་མེ་གཏོང་བ་དེ་ལ་ཡང་གནོད་སེམས་བསྐྱེད་པར་མི་བྱའི་གཉི་ག་ལ་ཡང་མཉམ་པའི་སེམས་བསྐྱེད་པར་བྱ་སྟེ།
en: Venerable Pūrṇa replied, “Venerable Śāradvatīputra, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood should not have any fondness for the person who rubbed their body with sandalwood oil, nor should they feel any hostility toward the person who hurled fire at them.

source: དེ་ལྟར་སྤྱོད་ཅིང་དེ་ལྟར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྒོམ་པ་ཡིན་ནོ།
en: Rather, they should be impartial with regard to both of these people. If bodhisattva great beings can do that, practicing in that manner, they are training in the perfection of patience.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྤྱོད་ཡུལ་ལ་སྤྱོད་དོ།
en: Bodhisattva great beings who are practicing the perfection of patience are engaged in the sphere of experience of a bodhisattva.

source: །དེ་ལྟར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཞིང་ལ་གནས་སོ།
en: When bodhisattva great beings practice in that way, they find themselves in the realm of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནོད་སེམས་མང་བར་མི་བྱ་སྟེ།
en: Bodhisattva great beings should not be hostile.

source: བཟོད་པ་ཕུན་སུམ་ཚོགས་པར་བྱའོ། །དྲན་པ་དང་ལྡན་པ་དང་། གནས་པ་དང་ལྡན་པ་དང་། ལྷག་པའི་བསམ་པ་དང་ལྡན་པ་དང་།
en: Instead, they should be genuinely patient, mindful, and grounded.

source: མི་ཁྲོ་བ་དང་། ཁོན་དུ་མི་འཛིན་པ་དང་། ཐམས་ཅད་ལ་བྱམས་པའི་སེམས་སུ་བྱ་ཞིང་འཁོར་གནོད་སེམས་ཀྱི་སེམས་དང་ལྡན་པར་གནས་པ་འཐབ་པའི་རང་བཞིན་ཅན། མཚང་འདྲུ་བའི་རང་བཞིན་ཅན།
en: They should be benevolent, be unaggressive, hold no grudges, and love everyone.

source: རྩོད་པའི་རང་བཞིན་ཅན་དུ་གནས་པ་རྣམས་ལ་སྡུམས་བྱ་ཞིང་སྡུམས་བྱེད་དུ་གཞུག་པར་བྱ་སྟེ།
en: Whenever they should come across people who are hostile, aggressive, confrontational, or argumentative, bodhisattvas should be conciliatory and try to make peace.

source: འདི་ལྟར་ང་ནི་ཁྱེད་ཅག་མི་འཐབ་པ་དང་། མཚང་མི་འདྲུ་བ་དང་། མི་རྩོད་པ་དང་། མི་འགྱེད་པར་བྱ་བའི་ཕྱིར་གནས་ཏེ།
en: They should think to themselves, ‘I will not quarrel with or provoke you. Nor will I be confrontational or divisive.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཆོས་བསྟན་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: And when I awaken to unsurpassed and perfect buddhahood, I will teach you the Dharma.’

source: །ལས་དེའི་རྣམ་པར་སྨིན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སོ་ཐགས་བཟང་བ་དང་། སོ་དམ་པ་དང་། སོ་མཉམ་པ་སྐྱེས་བུ་ཆེན་པོའི་མཚན་ལུས་ལ་མངོན་པར་འགྲུབ་པར་འགྱུར་རོ།
en: When that karmic act ripens, the signs of a great being will manifest on the bodhisattva great beings’ body in the form of teeth that are well arranged, perfect, and even.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་དང་པོའོ།། །།
en: This is the first chapter from “The Perfection of Patience.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པ་གང་ཡིན་པ་དང་། ཉན་ཐོས་ཀྱི་བཟོད་པ་གང་ཡིན་པ་འདི་གཉིས་ལ་གང་ཆེས་རྒྱ་ཆེ་བ་དང་། ཆེས་བཟང་བ་དང་། ཆེས་རང་བཞིན་གྱིས་འོད་གསལ་བ་དང་། ཆེས་སྟོབས་དང་ལྡན་པར་རིག་པར་བྱ།
en: Venerable Śāradvatīputra said to Venerable Pūrṇa Maitrāyaṇīputra, “Venerable Pūrṇa, when comparing the patience of the bodhisattva great beings and the patience of the hearers, which of these two should be regarded as greater and more excellent, naturally radiant, and powerful?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་དེའི་ཕྱིར་འདི་ཁྱོད་ཉིད་ལ་དྲི་བར་བྱས་ཁྱོད་ཇི་ལྟར་བཟོད་པ་དེ་བཞིན་དུ་ལན་ཐོབ་ཤིག །
en: Venerable Pūrṇa replied, “Venerable One, let me ask you about this instead, and you will find your answer about patience.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན། འཛམ་བུ་ཆུ་བོའི་གསེར་གང་ཡིན་པ་དང་། ར་གན་གང་ཡིན་པ་འདི་གཉིས་ལ། གང་ཆེས་རྒྱ་ཆེ་བ་དང་། ཆེས་བཟང་བ་དང་། ཆེས་འོད་གསལ་བ་དང་། ཆེས་རིན་ཐང་ཆེ་བ་ཡིན།
en: Venerable Śāradvatīputra, as an analogy, when comparing the gold of the Jambu River to brass, which of these two is greater and more excellent, radiant, and valuable?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ། འཛམ་བུ་ཆུ་བོའི་གསེར་ཆེས་རྒྱ་ཆེ་བ་དང་། ཆེས་བཟང་བ་དང་། ཆེས་འོད་གསལ་བ་དང་། ཆེས་རིན་ཆེ་བ་ཡིན་ནོ། །
en: Śāradvatīputra replied, “Venerable Pūrṇa, the gold in the Jambu River is greater and more excellent, radiant, and valuable.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཉན་ཐོས་ཀྱི་བཟོད་པ་ནི་ར་གན་གྱི་འོད་ཇི་ལྟ་བ་བཞིན་དུ་བལྟའོ། །བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ནི་འཛམ་བུ་ཆུ་བོའི་གསེར་གྱི་འོད་ཇི་ལྟ་བ་བཞིན་དུ་བལྟའོ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, you should view the patience of the hearers like the luster of brass while the patience of the bodhisattvas is like the luster of gold from the Jambu River.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་གལ་ཏེ་འདི་ལྟར་ལ་ལ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཡན་ལག་དང་ཉིང་ལག་རྣམས་གཅོད་ན། དེ་ལ་འདི་ལྟར་གང་གཱའི་ཀླུང་ཆེན་པོའི་བྱེ་མའི་ཚད་ནི་གཟུང་བར་ནུས་ཀྱི། ལུས་འདི་དག་གི་ཚད་གཟུང་བ་ནི་མ་ཡིན་ནོ།
en: Venerable Śāradvatīputra, moreover, if someone were to cut off all of a bodhisattva great being’s major and minor body parts, he should tell himself, ‘It may be possible to comprehend the number of grains of sand in the great Ganges but it is impossible to calculate the number of bodies I have had in the past.

source: །བདག་གི་ལུས་ཀྱི་ཡན་ལག་དང་ཉིང་ལག་བཅད་པ་གང་ཡིན་པ་དེ་དག་ནི་རི་རབ་ཙམ་འདས་པའི་ཕྱིར་རོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: If the body parts that have been severed from my past bodies were to be piled up, the heap would be larger than Mount Meru.’

source: །དོན་གྱི་དབང་འདི་ཡང་དག་པར་མཐོང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་ལུས་ལ་གཅོད་དམ། འབིགས་ན་ཡང་། གནོད་སེམས་བསྐྱེད་པར་མི་བྱའི།
en: Bodhisattva great beings who understand the implications of this should therefore not feel any hostility even when their body is cut up or pierced.

source: བྱམས་པ་དང་ལྡན་པའི་སེམས་སྐྱེས་སོ་ཅོག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: Instead, they should develop love and dedicate it all for the sake of omniscience.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: If they can do so, those bodhisattvas will never be apart from the perfection of patience.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ནི་སེམས་ས་དང་འདྲ་བ་དང་། སེམས་ཆུ་དང་འདྲ་བ་དང་། སེམས་མེ་དང་འདྲ་བ་དང་། སེམས་རླུང་དང་འདྲ་བ་དང་། སེམས་ནམ་མཁའ་དང་འདྲ་བར་བྱའོ།
en: Venerable Śāradvatīputra, moreover, bodhisattva great beings who wish to awaken to unsurpassed and perfect buddhahood should make their minds similar to the earth, water, fire, wind, and space.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ས་དང་འདྲ་བ་ཡིན་ཞིང་། སེམས་ཆུ་དང་འདྲ་བ་དང་། སེམས་མེ་དང་འདྲ་བ་དང་། སེམས་རླུང་དང་འདྲ་བ་དང་། སེམས་ནམ་མཁའ་དང་འདྲ་བ་ཡིན།
en: Śāradvatīputra replied, “Venerable Pūrṇa, what does it mean that bodhisattva great beings’ minds should be similar to the earth, water, fire, wind, and space?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དཔེར་ན་ས་ནི་ཡིད་དུ་འོང་བའི་བྱུག་པ་རྣམས་ཀྱིས་བྱུགས་ན་ཡང་རྗེས་སུ་ཆགས་པ་མེད་ལ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, as an analogy, if you anoint the earth with a beautiful ointment, it feels no attachment toward that.

source: དེ་ལས་གཞན་པའི་ཡིད་དུ་མི་འོང་བས་བྱུགས་ན་ཡང་ཁོང་ཁྲོ་བར་འགྱུར་བ་མེད་དོ།
en: Alternatively, if you smear the earth with a repulsive ointment, there is no anger.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཡང་ཡིད་དུ་འོང་བའི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་རྣམས་ཀྱིས་རྗེས་སུ་ཆགས་པ་བསྐྱེད་པར་མི་བྱ།
en: Similarly, bodhisattvas do not feel any attachment to beautiful sights, sounds, smells, tastes, or textures.

source: ཡིད་དུ་མི་འོང་བའི་གཟུགས་དང་། སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་རྣམས་ཀྱིས་ཀྱང་ཁོང་ཁྲོ་བར་མི་བྱ།
en: Nor do they feel hostility toward repulsive sights, sounds, smells, tastes, or textures.

source: མི་བཟོད་པ་དང་། དང་བ་ཆུང་བ་བསྐྱེད་པར་མི་བྱ། གནོད་སེམས་བསྐྱེད་པར་མི་བྱ་སྟེ།
en: They do not lose their patience, lessen in their enthusiasm, or develop any hostility.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ས་དང་འདྲ་བ་ཡིན་ཞིང་། དེ་ལྟར་ན་སེམས་ཆུ་དང་མེ་དང་། རླུང་དང་འདྲ་བ་ཡིན་ནོ།
en: Therefore, the minds of the bodhisattvas are similar to the earth as well as to water, fire, and wind.

source: །ཇི་ལྟར་ན་སེམས་ནམ་མཁའ་དང་འདྲ་བ་ཡིན་ཞེ་ན།
en: How are their minds similar to space?

source: ནམ་མཁའ་ཇི་ལྟར་ཡིད་དུ་འོང་བའི་བྱུག་པ་རྣམས་ཀྱིས་ཀྱང་རྗེས་སུ་ཆགས་པར་མི་འགྱུར་ལ། དེ་ལས་གཞན་པའི་ཡིད་དུ་མི་འོང་བ་བཤང་གཅི་རྣམས་ཡོད་པས་ཀྱང་ཁོང་ཁྲོ་བར་མི་འགྱུར་རོ།
en: Well, space does not feel attachment to any ointment, no matter how delightful, nor does it feel any aversion to repulsive excrement or urine.

source: །དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཡིད་དུ་འོང་བའི་གཟུགས་རྣམས་ཀྱིས་ཀྱང་རྗེས་སུ་ཆགས་པ་བསྐྱེད་པར་མི་བྱ། ཡིད་དུ་མི་འོང་བ་རྣམས་ཀྱིས་ཀྱང་ཁོང་ཁྲོ་བར་མི་བྱའོ།
en: In just the same way, bodhisattva great beings do not develop any attachment to beautiful forms, nor do they feel aversion to ugly forms.

source: །དེ་བཞིན་དུ་སྒྲ་དང་། དྲི་དང་། རོ་དང་། རེག་པ་ཡིད་དུ་འོང་བ་རྣམས་ཀྱིས་ཀྱང་རྗེས་སུ་ཆགས་པ་བསྐྱེད་པར་མི་བྱའོ།
en: Similarly, neither do they develop any attachment to pleasant sounds, smells, tastes, or textures, nor aversion to repulsive ones.

source: །ཡིད་དུ་མི་འོང་བའི་རེག་པའི་བར་དག་གིས་ཀྱང་ཁོང་ཁྲོ་བར་མི་བྱ་ཞིང་མི་བཟོད་པ་དང་། དང་བ་ཆུང་བ་བསྐྱེད་པར་མི་བྱའོ།
en: They do not lose their patience or lessen in their enthusiasm.

source: །དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ནམ་མཁའ་དང་འདྲ་བར་རིག་པར་བྱའོ།
en: This is why the minds of bodhisattva great beings are like space.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ས་དང་འདྲ་བ་ཡིན་ཞིང་། སེམས་ཆུ་དང་འདྲ་བ་དང་། སེམས་མེ་དང་འདྲ་བ་དང་། སེམས་རླུང་དང་འདྲ་བ་དང་། སེམས་ནམ་མཁའ་དང་འདྲ་བ་ཡིན་ནོ།
en: Venerable Śāradvatīputra, this is how the minds of bodhisattva great beings are like the earth, water, fire, wind, and space.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ནམ་མཁའ་དང་འདྲ་བ་ནི་བགྲང་དུ་མེད་པ་ན། ཅི་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བགྲང་དུ་མེད་པ་ཞིག་གམ།
en: Śāradvatīputra asked, “Venerable Pūrṇa, anything that is like space must be infinite, so does that mean that bodhisattvas are infinite?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔས་ལུས་ཀྱི་ཡིད་འདི་ནམ་མཁའ་དང་འདྲ་བར་རྣམ་པར་བརྟག་པར་བྱ་སྟེ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, bodhisattvas should consider the mind within their body to be like space.

source: དེ་ལྟར་དཔྱོད་ཅིང་རྟོག་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དབྱུག་པའི་རེག་པ་རྣམས་དང་། བོང་པའི་རེག་པ་རྣམས་དང་། མཚོན་ཆའི་རེག་པ་རྣམས་དང་དུ་ལེན་པ་ལ་མཐུ་ཡོད་ཅིང་མཁས་པ་ཡིན་ནོ།
en: If they can reason and think in this way, then the bodhisattva great beings will have the strength and skill to bear the blows of sticks, clubs, and weapons.

source: །དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ནས་ལུས་ཀུན་ལ་སོ་སོར་བརྟགས་ཏེ།
en: Likewise, by means of the perfection of wisdom, they should understand all bodies in this way.

source: བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་འཛིན་ཅིང་སེམས་ཅན་དམྱལ་བ་པའི་སྡུག་བསྔལ་གང་དག་ཡིན་པ་དང་།
en: Then the bodhisattvas can uphold the perfection of patience.

source: སེམས་ཅན་དམྱལ་བ་པའི་མེ་གང་ཡིན་པ་དང་། སེམས་ཅན་དམྱལ་བ་པའི་མཚོན་ཆ་དང་། དབྱུག་པའི་རེག་པ་གང་དག་ཡིན་པ་དེ་རྣམས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་ཟིན་པ་ལ་དང་དུ་ལེན་པའི་མཐུ་ཡོད་པ་ཡིན་ཏེ།
en: Since they embrace the perfection of wisdom, they will have the strength to bear all the sufferings experienced by beings in the hells, including the fires and the blows of the hell beings’ weapons and sticks.

source: དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡིན་ནོ།
en: The ability to bear hardship is itself the perfection of patience.

source: འཁོར་བ་ཐོག་མ་མེད་པ་ནས་སྡུག་བསྔལ་དེ་དག་སོ་སོར་མྱོང་ལ།
en: Since beginningless time in saṃsāra, bodhisattvas have experienced all of these sufferings.

source: སྡུག་བསྔལ་རྣམས་མྱོང་ནས་ཀྱང་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཡང་མ་ཐོབ་ལ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཡང་མ་ཡིན། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཡང་མ་ཡིན། དགྲ་བཅོམ་པ་ཉིད་ཀྱང་མ་ཡིན། རང་བྱང་ཆུབ་ཀྱང་མ་ཐོབ་སྟེ།
en: However, even though they had to suffer in this way, they did not attain the result of a stream enterer, nor the result of a once-returner, nor the result of a non-returner, nor the state of a worthy one, nor did they attain awakening by themselves.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དོན་གྱི་དབང་འདི་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་ནས་སྡུག་བསྔལ་དེ་དག་དང་དུ་བླང་བར་བྱའོ།
en: However, as bodhisattva great beings perceive the implications, they should be able to bear those sufferings.

source: །དཔེར་ན་མི་ལ་ལ་ཁ་ཟས་རོ་བརྒྱ་པ་ཟ་ན་ཚིམ་པ་དང་། མོས་པ་དང་། ཡི་རངས་པ་དང་། མགུ་བར་འགྱུར་ཞིང་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: As an analogy, if a man has a delicious meal, he will feel satisfied, delighted, happy, pleased, joyful, and content.

source: རབ་ཏུ་དགའ་བར་གྱུར་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔས་སློང་བ་མཐོང་ན་གང་དེ་ལ་ལུས་སྡུག་བསྔལ་བར་བྱ་བར་འདོད་པ་ཞིག་ཡིན་དུ་ཟིན་ཀྱང་ཇི་ལྟར་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པས་དེ་བཞིན་གཤེགས་པ་མཐོང་ན་དགའ་བ་དང་། དད་པ་དང་། གུས་པ་བསྐྱེད་པ་དེ་བཞིན་དུ། བྱང་ཆུབ་སེམས་དཔས་སློང་བའི་གང་ཟག་དེ་ལ་སེམས་བསྐྱེད་པར་བྱའོ།
en: He might even feel exhilarated. Likewise, when bodhisattvas see a beggar, even if it is someone who wants to harm those bodhisattvas, they should feel the same joy, deference, and respect for the beggar as a worthy one who has exhausted all defilements would feel if he saw the Thus-Gone One.

source: །སེམས་བསྐྱེད་པ་སྐྱེས་སོ་ཅོག་ཀྱང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་བསྔོ་བར་བྱའོ།
en: They should then dedicate the entire mental process involved toward omniscience.

source: །ཡོངས་སུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པར་རིག་པར་བྱའོ།
en: Doing so, those bodhisattva great beings are upholding the perfection of patience.”

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ལེའུ་གཉིས་པའོ།། །།
en: This is the second chapter from “The Perfection of Patience.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཤེ་ཡང་ཕྱིར་མི་གཤེ་སྟེ། བཟོད་པ་འབའ་ཞིག་བྱེད་དོ།
en: Pūrṇa continued, “Venerable Śāradvatīputra, moreover, if bodhisattva great beings are being scolded, they should not retaliate but remain patient.

source: འདི་ལྟ་སྟེ། དེས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་བརྡེགས་ཀྱང་ཕྱིར་མི་རྡེག །
en: Because that way they do not abandon omniscience. Even if they are struck, they should not fight back.

source: ཁྲོས་ཀྱང་ཕྱིར་མི་ཁྲོ།
en: When people are hostile, they should not get angry.

source: བསྡིགས་ཀྱང་ཕྱིར་སྡིགས་པར་མི་བྱེད།
en: When they are abused, they should not repay in kind.

source: སྤྱོས་ཀྱང་ཕྱིར་སྤྱོ་བར་མི་བྱེད་དེ་བཟོད་པ་འབའ་ཞིག་བྱེད་དོ།
en: When people revile them, they should not reciprocate. Instead, they should simply remain forbearing.

source: འདི་ལྟ་སྟེ། དེས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མ་བཏང་བའི་ཕྱིར་རོ།
en: Because that way they do not abandon omniscience.

source: །གལ་ཏེ་དེ་ལ་མདུང་ཐུང་དང་། མདའ་སྟོང་གིས་ལུས་ལ་ཕོག་ཀྱང་དེ་ལ་སེམས་སྡང་བར་མི་བྱ། དེ་ལ་མི་བཟོད་པ་དང་། དང་བ་མེད་པ་དང་། ངང་ཐུང་བ་བསྐྱེད་པར་མི་བྱའོ།
en: Even if others stab them with spears or arrows, they should not become angry, impatient, disturbed, or short-tempered.

source: །དེ་ལྟར་སྤྱོད་ན། བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡིན་ཏེ། ལུས་ལ་ཡང་གསེར་གྱི་ཁ་དོག་ཡོངས་སུ་འཛིན་པར་འགྱུར་རོ།
en: If they can succeed in that manner, those bodhisattvas will be practicing the perfection of patience and even their body will begin to shine with a golden complexion.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བཟོད་པའི་སྟོབས་དང་ལྡན་པ་དང་། དང་དུ་ལེན་པའི་རང་བཞིན་ཅན་དུ་བྱའོ།
en: Venerable Śāradvatīputra, in this way bodhisattva great beings should possess the strength of patience and the willingness to joyfully accept difficult situations.

source: འདི་ལྟ་སྟེ། བཟོད་ཅིང་དང་དུ་ལེན་པ་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་འཛིན་པ་ཡིན་ཏེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཉེ་བར་འགྱུར་ལ་འཁོར་བའི་སྡུག་བསྔལ་རྣམས་ཀྱང་རིང་བར་བྱེད་དོ།
en: That is because with patience and joyful acceptance they can uphold the perfection of patience, approach the omniscient state, and distance themselves from the sufferings of saṃsāra.

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས་ཉམས་པ་ཡིན་ནོ།
en: However, if bodhisattvas are attracted to the levels of the hearers or the solitary buddhas, their practice of the perfection of patience is weakened.

source: ལུས་ལ་སྡུག་བསྔལ་དེ་སྙེད་བྱུང་བ་དང་དུ་བླངས་ཀྱང་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་ས་ལ་འདོད་པར་བྱེད་ན། བྱང་ཆུབ་སེམས་དཔས་རང་གི་སྤྱོད་ཡུལ་བོར་ཏེ། གཞན་གྱི་སྤྱོད་ཡུལ་ལ་གནས་པ་ཡིན་པར་ཡང་རིག་པར་བྱའོ། །
en: Because, if they are attracted to the levels of the hearers or the solitary buddhas, no matter how much suffering they take upon themselves, those bodhisattvas have abandoned their proper experience and strayed into a different domain.”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་ཞེས་བྱ།
en: Śāradvatīputra asked, “Venerable Pūrṇa, what does it take for bodhisattvas to stray into a different domain?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཉན་ཐོས་ཀྱི་སའམ། རང་སངས་རྒྱས་ཀྱི་སའམ། ཉན་ཐོས་ཀྱི་ཡིད་ལ་བྱེད་པ་རྣམས་སམ། རང་སངས་རྒྱས་ཀྱི་ཡིད་ལ་བྱེད་པ་རྣམས་སམ། ཉན་ཐོས་ཀྱི་ལམ་མམ། རང་སངས་རྒྱས་ཀྱི་ལམ་ལ་འདོད་པ་གང་ཡིན་པ་དེ་ནི་དེ་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, whether bodhisattvas are attracted to the levels of the hearers or the solitary buddhas, or the mindset of the hearers or the solitary buddhas, or the paths of the hearers or the solitary buddhas, that in itself causes the bodhisattvas to stray into a different domain.”

source: །སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་བྱང་ཆུབ་སེམས་དཔའི་རང་གི་སྤྱོད་ཡུལ་གང་ཡིན།
en: Śāradvatīputra asked, “Venerable Pūrṇa, what is the proper domain of bodhisattvas?”

source: སྨྲས་པ། འདི་ལྟ་སྟེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པར་ཡིད་ལ་བྱེད་པ་སྟེ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, bodhisattvas should be concerned with the six perfections and the state of omniscience.

source: འདི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་ཏེ།
en: The domain of the bodhisattvas consists of the perfection of generosity, the perfection of discipline, the perfection of patience, the perfection of diligence, the perfection of concentration, and the perfection of insight.

source: འདི་དག་ལ་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའ་རང་གི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: When bodhisattvas are practicing these perfections, they engage in the proper domain of bodhisattvas.

source: །དེ་ལ་ནི་བདུད་སྡིག་ཅན་གྱིས་ཀྱང་གླགས་མི་རྙེད་དེ།
en: For such people, even the evil Māra will find no opportunity to cause any harm.

source: དཔེར་ན་རུས་སྦལ་ལ་ཝས་གླགས་མི་རྙེད་དེ། དེ་གླགས་མ་རྙེད་ནས་སྐྱོ་སྟེ་ཕྱིར་འགྲོ་བ་དེ་བཞིན་དུ།
en: As an analogy, a fox is unable to harm a tortoise and when it realizes that, it tires and leaves.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ། བྱང་ཆུབ་སེམས་དཔའ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ལ་བདུད་སྡིག་ཅན་གྱིས་གླགས་མི་རྙེད་དེ་གླགས་མ་རྙེད་ནས་སྐྱོ་སྟེ་ཕྱིར་འགྲོའོ།
en: In the same way, Venerable Śāradvatīputra, when bodhisattvas train in the six perfections, the evil Māra can find no chance to harm them and, realizing that, he tires and leaves.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གལ་ཏེ་བདུད་སྡིག་ཅན་གྱིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སེམས་ཅན་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་ཀྱི་བདུད་སྡིག་ཅན་མངོན་པར་སྤྲུལ་ལ་བདུད་རེ་རེ་ཡང་དེ་སྙེད་ཀྱི་འཁོར་གྱིས་བསྐོར་བར་གྱུར་ཀྱང་། དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ལ་གླགས་རྙེད་པའི་སྐལ་བ་མེད་དེ་གླགས་མི་རྙེད་པས་སྐྱོ་ནས་ཕྱིར་འགྲོ་བར་འགྱུར་ཏེ། རུས་སྦལ་དང་ཝ་བཞིན་ནོ།
en: Venerable Śāradvatīputra, even if the evil Māra were to emanate as many evil demons as there are beings in the entire trichiliocosm and equip each of those demons with a retinue of that same number of demons, they would find no opportunity to harm the bodhisattva great beings who are practicing the six perfections. Not having any success, they would tire and leave, just like the fox leaves the tortoise.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདི་ལྟར་ཇི་ལྟར་བྱས་ན་བདག་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་དང་མི་འབྲལ་བའི་སེམས་སུ་འགྱུར་ལ།
en: Venerable Śāradvatīputra, therefore, bodhisattva great beings should tell themselves, ‘Whatever happens, I will never relinquish the six perfections.

source: དེ་ལྟར་གྱུར་ན་བདག་ལ་བདུད་སྡིག་ཅན་གྱིས་གླགས་མི་རྙེད་དོ་སྙམ་དུ་ཡང་སེམས་བསྐྱེད་པར་མི་བྱའོ། །
en: If I succeed in that, the evil Māra shall have no chance to harm me.’ ”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན། བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱ།
en: Śāradvatīputra asked, “Venerable Pūrṇa, how can one tell if bodhisattvas are influenced by demons?”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་མི་ཉན་པ་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།
en: Pūrṇa replied, “Venerable Śāradvatīputra, one can tell that bodhisattva great beings are influenced by demons if they do not listen to the perfections.

source: །ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་མི་སྒྲུབ་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བདུད་ཀྱི་ལས་སུ་རིག་པར་བྱའོ།
en: Likewise, one can tell that bodhisattvas are influenced by demons if they are not accomplishing the perfections.

source: །བདུད་སྡིག་ཅན་ནི་བདག་གི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཆད་བྱ་བའི་ཕྱིར་ཉེ་བར་གནས་པའོ་ཞེས་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་དེ་ལ་གནོད་སེམས་སམ། མི་བཟོད་པ་བསྐྱེད་པར་མི་བྱའོ།
en: Bodhisattvas should not become hostile or lose their patience even if they realize, ‘This demon is approaching me in order to create obstacles for my attainment of omniscience.’

source: །དེ་ལྟར་སྤྱོད་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྤྱོད་པ་ཡིན་ནོ།
en: If bodhisattva great beings can act like that, they are practicing the perfection of patience.

source: །བྱང་ཆུབ་སེམས་དཔས་འདི་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤང་བའི་ཕྱིར་ཆོས་བཤད་པར་བྱའོ་སྙམ་དུ་སེམས་བསྐྱེད་པར་བྱའོ།
en: The bodhisattvas should then think, ‘When I awaken to unsurpassed and perfect buddhahood, I will teach the Dharma to all beings in order to eradicate their attachment, anger, and delusion.’

source: །གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེའི་ཚེ་དྲན་པ་རྙེད་ན། བདུད་སྡིག་ཅན་ཟིལ་གྱིས་གནོན་པ་ཡིན་ནོ།
en: If bodhisattva great beings can be mindful at that time, they will overcome the evil Māra.

source: །གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པ་དག་དང་བྲལ་བར་གྱུར་ན་བདག་སྤྱོད་ཡུལ་མ་ཡིན་པར་ལྷུང་བར་མ་གྱུར་གྲང་ཞེས་རིག་པར་བྱའོ།
en: Whenever bodhisattvas lose sight of the state of omniscience, they should tell themselves, ‘I have strayed into an incorrect domain.’

source: འདི་ལྟར་བདག་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་མི་ལྡན་པའི་ཕྱིར་རོ་ཞེས་བདག་ཉིད་ཀྱི་སེམས་ལ་བརྒྱད་བཀག་པར་བྱའོ། །
en: Because in that way they can reprimand themselves saying, ‘I have lost sight of omniscience.’ ”

source: སྨྲས་པ། ཚེ་དང་ལྡན་པ་གང་པོ་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉིན་མོ་ཆུད་ཟོས་པར་བྱེད་པ་ཡིན།
en: Śāradvatīputra asked, “Venerable Pūrṇa, how do bodhisattvas waste their time?”
